recipes/roast-cauliflower-tacos.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Roasted Cauliflower Tacos with Green Tahini Sauce</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="james" />
<link rel="stylesheet" type="text/css" href="../static/recipe.css" />
<link rel="icon" type="image/ico" href="../static/favicon.svg" />
</head>
<body>
<div id="org-div-home-and-up"> <a href="../index.html"> Home </a> </div> <div id="btns"><button id="copy-btn" onclick="copyTicked()"></button> <button id="untick-btn" onclick="untickAll()"></button></div><div id="notify">Copied!</div><div id="content">
<h1 class="title">Roasted Cauliflower Tacos with Green Tahini Sauce</h1>

<div id="outline-container-orgd61bb1d" class="outline-2">
<h2 id="orgd61bb1d">Ingredients</h2>
<div class="outline-text-2" id="text-orgd61bb1d">
</div>
<div id="outline-container-org44d60cf" class="outline-3">
<h3 id="org44d60cf">Tahini sauce</h3>
<div class="outline-text-3" id="text-org44d60cf">
<ul class="org-ul">
<li>1/3 cup tahini</li>
<li>1 cup fresh coriander leaves, plus more to serve</li>
<li>1/2 clove garlic</li>
<li>Juice of 1 lemon</li>
<li>1 teaspoon ground cumin</li>
<li>3/4 teaspoon salt</li>
<li>1/4 teaspoon black pepper</li>
</ul>
</div>
</div>

<div id="outline-container-org0f8b9a5" class="outline-3">
<h3 id="org0f8b9a5">Tacos</h3>
<div class="outline-text-3" id="text-org0f8b9a5">
<ul class="org-ul">
<li>1 medium cauliflower, chopped into florets</li>
<li>2 tablespoons olive oil</li>
<li>1 tablespoon cumin</li>
<li>1 tablespoon smoked paprika</li>
<li>1 teaspoon salt</li>
<li>1/2 teaspoon pepper</li>
<li>8 tortillas</li>
<li>purple cabbage, shredded</li>
<li>1 avocado, sliced</li>
<li>1 chilli, sliced</li>
<li>1 lime, cut into wedges</li>
</ul>
</div>
</div>

<div id="outline-container-org0101c54" class="outline-3">
<h3 id="org0101c54">Pico de Gallo</h3>
<div class="outline-text-3" id="text-org0101c54">
<ul class="org-ul">
<li>Red onion</li>
<li>Tomato</li>
<li>Corn</li>
<li>Avocado</li>
<li>Lime juice</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgc7e3aef" class="outline-2">
<h2 id="orgc7e3aef">Instructions</h2>
<div class="outline-text-2" id="text-orgc7e3aef">
<ol class="org-ol">
<li>Preheat oven to 180&deg;C.</li>
<li>For TAHINI SAUCE, blend all ingredients in a small food processor or blender until the texture is similar to pesto. Gradually drizzle in 5 tablespoons water and blend until sauce is light green and creamy.</li>
<li>FOR TACOS, coat cauliflower with olive oil, cumin, paprika, salt and pepper. Roast for 25 minutes or until golden brown, tossing halfway through.</li>
<li>Heat tortillas according to packet instructions.</li>
<li>Chop Pico ingredients and mix.</li>
<li>TO ASSEMBLE, fill each taco with roasted cauliflower. Top with the cabbage and sliced avocado, and drizzle with the tahini sauce. Garnish with extra coriander, chilli and lime.</li>
</ol>
</div>
</div>

<div id="outline-container-orge7dfb81" class="outline-2">
<h2 id="orge7dfb81">Notes</h2>
<div class="outline-text-2" id="text-orge7dfb81">
<p>
Tahini sauce and roasted cauliflower can be stored in airtight containers in the fridge for up to 3 days. The tahini sauce can be frozen.
</p>
</div>
</div>
</div>
</body>
</html>
